{"Hed":"","Dek":"How to keep busy in the time before live music returns.","Byline":"","Intro1":"It might be a long time before we can see live music again. As three musicians ourselves (here’s Kevin at a… and here’s Kat drumming at a basement punk bar in San Marcos), we couldn’t miss live music any more. And while some people think that the live album is dead, or that over produced studio versions have ruined rock and roll, we hope that the current plague of cancelled shows and closed venues will be followed by a renaissance of live music and performance.","Intro2":"David Byrne writes “As music becomes less of a thing–a cylinder, a cassette, a disc–and more ephemeral, perhaps we will begin to assign an increasing value to live performances again.” But what makes a live performance valuable? The random banter outside of the lyrics we know by heart? The spontaneous guitar solos? Or the solidarity of strangers in the audience who love that band as much as you do? Maybe it’s something more external, like the surrounding context of the show (Johnny Cash’s prison performances, Nirvana’s intimate NYC acoustic set, or LCD Soundsystem’s “final goodbye” Madison Square Garden show), that give us insight into what was going on with the audience, the artist, and the world, at the time of the performance.","BD1":"For instance, Blowin’ in the Wind, doesn’t exactly come to mind as the encore to end a cross country stadium tour. The folk ballad is often sung at a slow, ticking rate. Dylan asks a series of rhetorical questions over a simple acoustic strumming pattern, and like many others from our favorite folk rock poet, the song is a symbol of protest, albeit a calm one.","BD2":"The studio-recorded version of the song, off of Freewheelin’ Bob Dylan, is a three minute track that sounds almost like a lullaby: Dylan metronomically recites the lyrics, only pausing for a short, intimate, harmonica break in the middle.","BD3":"The live-recorded version of the song, however, off of Before the Flood, is a five minute energetic celebration. Recorded here at the Los Angeles Forum during the tail end of Dylan’s 1974 American tour with The Band, the artist (and the audience) take on a new energy. Fans cheer, and the drums pick up in the background as you hear Dylan’s voice creak over the mic. A guitar solo halfway through replaces Dylan’s studio harmonica, and almost ten seconds of applause linger on as he shouts “Thank you, Goodnight!”.  It’s as if, over the backdrop of a nation closer to the end of the Vietnam War that first inspired the song, the lyrics take on a different tone.","Jukebox1":"10,000 live discographies might be too much to listen back to and compare, even for the biggest music nerds among us. Luckily, Spotify includes auditory features on these songs that make it easier to compare quantitatively. The audio features include qualities like the amount of acoustics in a track, duration of a song, and some more subjective features like valence, which is an algorithmic detection of positivity in audio.","Jukebox2":"We pulled these auditory features, album art, and 20 second sample together into a LiveMusic JukeBox. Click through to identify an artist and compare their studio and live tracks.","Methods":""}