{"hed":"Introducing the Live Music Jukebox","dek":"Dek here etc","byline":"by <a href=https://pudding.cool/author/kat-wilson/>Kat Wilson</a> and <a href=https://pudding.cool/author/kevin-litman-navarro/>Kevin Litman-Navarro</a>","Intro1":"It’s been a long time since we’ve seen live music. Of course, with modern streaming platforms, there’s more than enough recorded music to keep us safely locked down ad infinitum; yet there remains a deficiency in our musical diets amidst the plague of cancelled shows and closed venues.","Intro2":"What exactly do we miss? Is it the random banter outside of the lyrics we know by heart? A slow jam revived as an up-tempo frenzy? The spontaneous, five-minute guitar solos? A banger gone acoustic? Or the solidarity of strangers in the audience who love that band as much as you do? Maybe it’s the surrounding context of the show (Johnny Cash’s prison performances, Nirvana’s intimate NYC acoustic set, or LCD Soundsystem’s “final goodbye” Madison Square Garden show), that give us insight into what was going on with the audience, the artist, and the world, at the time of the performance.","pullquote":"“As music becomes less of a thing–a cylinder, a cassette, a disc–and more ephemeral, perhaps we will begin to assign an increasing value to live performances again.” — David Byrne, Talking Heads","Intro3":"In the time before we can go back to crowding Brooklyn Steel or catching an intimate set at Hole in the Wall, we decided to dive into the vast discography of live-recorded albums to try and satiate the desire to catch a show. First, we found as many live albums as we could and matched them to their studio counterparts using the SpotifyAPI. Then, by looking at the differences between live and studio songs using numerical metrics like energy (how intense or lively a track sounds), valence (a measurement of a song’s mood), and duration (to find those five-minute guitar solos), we found great live performances that we had missed.","BD1":"For instance, Bob Dylan’s Blowin’ in the Wind doesn’t exactly come to mind as the encore to end a cross country stadium tour. The folk ballad is typically sung at a slow, ticking rate; it sounds almost like a lullaby. Dylan metronomically recites the lyrics over a simple acoustic strumming pattern, only pausing for a short, intimate, harmonica break in the middle. When analyzing the data, we noticed that the live-recorded version of the song, off of Before the Flood, is, by contrast, a frenzied, five-minute celebration.","BD2":"Recorded at the Los Angeles Forum during the tail end of Dylan’s 1974 American tour with The Band, the artist (and the audience) take on a new energy. Listen to the difference below.","BD3":"In this version, fans cheer, and the drums pick up in the background as you hear Dylan’s voice creak over the mic. A guitar solo halfway through replaces Dylan’s studio harmonica, and almost ten seconds of applause linger on as he shouts “Thank you, Goodnight!”  It’s as if, over the backdrop of a nation closer to the end of the Vietnam War that first inspired the song, the lyrics take on a different tone.","TH1":"Other changes are more intentional. David Byrne, for instance, made the choice, when recording three live shows at the Pantages theater in Los Angeles with the Talking Heads, to have each musician and instrument come out onto the stage in succession, one at a time. Byrne was inspired by the minimalist Japanese theater, where stage props and actors were portable, to remove the fourth wall. The resulting performance, captured in the documentary film “Stop Making Sense” brings the audience into the music, creating a type of “build up” approach to sound. You can hear this change in songs like “Heaven,” an acoustic, stripped-down version of the original studio recording.","TH2":"For instance, compare the acoustic levels of Psycho Killer. The song begins the live set, with only David Byrne on an acoustic guitar, accompanied by a simple drum track played over a tape recorder. This live version is a drastically stripped down version of the original studio version, recorded six years earlier. The song “Heaven” takes on a similar change.","AF1":"Levels of speech and instrumentals often seesaw in live performance, too. The iconic saxophone solo in Aretha Franklin’s “Respect,” for example, is certainly not the center of attention, as it is in the studio version. Instead, Aretha’s backup singers take more of a central role. At the Filmore West in San Francisco in 1971, the jam starts out with some stage banter, and the tempo picks up way faster than the studio version. The sax solo is almost “rushed” through, and in its place, backup singers bring even more force to the song.","Jukebox1":"Using this data, we created the Live Music Jukebox. You can search for artists, and find the live tracks stand out the most compared to the studio version. You might even find someone new that you just have to see. With any luck, the Live Music Jukebox can tide you over until you’re back in the mosh pit, head banging and dancing the night away.","methods1":"There are an estimated 10,000 artists who have recorded live albums in recording history. One of our conceptual challenges was figuring out how to get a comprehensive list of artists and albums, while still parsing down the data to create a functional tool. Alas, we might have missed your favorite artist, but hope that we struck some sort of comprehensive list, and encourage you to dig for that underground live version you can’t find here. Our list of artists comes from Wikipedia’s list of live recorded albums, compared to the set of Pop/Rock artists who recorded at least one live recorded album by 9/16/2020, as they appear on AllMusic. We pulled the intersected list of artist names (about 10,950) from the Spotify API, and ended up with around 8,000 artists’ Spotify API data. We culled this list of artists by selecting only artists who had charted on the Billboard Hot 100.","methods2":"Raw SpotifyAPI data includes song level variables such as acoustics, speech levels, and duration of a song, and album level variables such as album name and year recorded. We hard coded a binary indicator of live/studio by identifying tracks with the string “Live” or “Sessions” in the track name or in the album name. We removed tracks with “Commentary”, “Rehearsals”, “Intro”, “Movie Soundtrack”, or “Demos” from the analysis, and only kept artists who had at least 7 recorded live songs, per the previously created variable, as an indicator that live songs are representative of a live album recording, rather than a one off recording.","methods3":"Using the new binary indicator of live/studio, we matched tracks by track name and artist name. This yielded multiple matches for a single song. For instance, seven live recordings of “Folsom Prison Blues” exist in the data set, and four studio recordings (Mercury Albums, Total Johnny Cash Sun Collection, All About the Blue Train, and I Walk the Line), giving us 28 possible matches to compare among Live to Studio. To cull the data for the project, we scraped the “popularity index” from our original artist list, and kept only the tracks with the highest popularity index. Using this new, parsed down, matched list of live and studio versions, we calculated the difference of audio features (acoustics, duration, instrumentals) from the live to studio version for each track.","methods4":"Music is in our hearts, and we will be the first ones back at the venues when they open up again. In the meantime, you can support live music during covid by getting your live performance ready for when the stage opens back, or find other ways to support live musicians."}